--ÈÕ³Ì°²ÅÅ
_tmp_calender = {
	weekend = {	--ÖÜÄ©ÈÕ³Ì£¬ÔÚÖÜÎå¡¢Áù¡¢ÈÕ²ÉÓÃ
		--¿ªÊ¼Ê±¼ä£¨·ÖÖÓ£©£¬±ÈÈü³¡Êý
		{18*60, 4},	--µÚÒ»¶Î
		{21*60, 4},	--µÚ¶þ¶Î
	},
	common = {	--Ò»°ãÈÕ³Ì£¬ÔÚÃ»ÓÐÌØ±ð°²ÅÅÊ±²ÉÓÃ
		--¿ªÊ¼Ê±¼ä£¨·ÖÖÓ£©£¬±ÈÈü³¡Êý
		{18*60, 4},
		{21*60, 4},	--µÚ¶þ¶Î
	}
}

--Èü¼¾°²ÅÅ
-- ÀàÐÍ£º1¡¢Ë«ÈË£»2¡¢ÃÅÅÉ£»3¡¢Ê¦Í½£»4¡¢ÈýÈË£»5¡¢»ìºÏµ¥ÈË£»6¡¢Í¬ÏµË«ÈË£»7¡¢»ìºÏË«ÈË
WLLS_SEASON_TB = {
	--[ID]={ÀàÐÍ, 	¿ªÊ¼ÈÕÆÚ,	½áÊøÈÕÆÚ,	²ÎÈü´ÎÊý,	ÈÕ³Ì°²ÅÅ}
	[0] = {2,		0,			0,			0,			{}},	--¿ÕÈü¼¾£¬¼«¶ËÇé¿ö±£»¤
	--[ID]={the loai(1=>7), 	ngay bat dau,	ngay ket thuc,	so tran toi da,	the lich}
	-- 1=   Song ®Êu tù do
	-- 2=  ®¬n ®Êu m«n ph¸i
	-- 3=  song ®Êu s­ ®å
	-- 4=  tam ®Êu tù do
	-- 5= ®¬n ®Êu tù do
	-- 6= song ®Êu cïng hÖ = sau nay bi loai bo
	-- 7= song ®Êu nam nö = sau nay bi loai bo
	-- n¨m 2014
	[40] = {2,		140108,		100128,		48,		_tmp_calender},
	[41] = {5,		140208,		140228,		48,		_tmp_calender},
	[42] = {5,		130308,		130328,		48,		_tmp_calender},
	[43] = {5,		140408,		140428,		48,		_tmp_calender},
	[44] = {5,		140508,		140528,		48,		_tmp_calender},
	[45] = {5,		140608,		140628,		48,		_tmp_calender},
	[46] = {5,		140708,		140728,		48,		_tmp_calender},
	[47] = {5,		140808,		140828,		48,		_tmp_calender},
	[48] = {5,		140908,		140928,		48,		_tmp_calender},
	[49] = {5,		141008,		141028,		48,		_tmp_calender},
	[50] = {5,		141108,		141128,		48,		_tmp_calender},
	[51] = {5,		141208,		141228,		48,		_tmp_calender},
	
	--n¨m 2015
	[52] = {5,		150108,		150128,		48,		_tmp_calender},
	[53] = {1,		150208,		150228,		48,		_tmp_calender},
	[54] = {2,		150308,		150328,		48,		_tmp_calender},
	[55] = {4,		150408,		150428,		48,		_tmp_calender},
	[56] = {1,		150508,		150528,		48,		_tmp_calender},
	[57] = {4,		150608,		150628,		48,		_tmp_calender},
	[58] = {5,		150708,		150728,		48,		_tmp_calender},
	[59] = {1,		150808,		150828,		48,		_tmp_calender},
	[60] = {4,		150908,		150928,		48,		_tmp_calender},
	[61] = {5,		151008,		151028,		48,		_tmp_calender},
	[62] = {3,		151108,		151128,		48,		_tmp_calender},
	[63] = {4,		151208,		151228,		48,		_tmp_calender},
	
	-- Update lÞch cho n¨m 2012 - modified By DinhHQ -2120109
	[64] = {5,		160108,		160128,		48,		_tmp_calender},
	[65] = {1,		160208,		160228,		48,		_tmp_calender},
	[66] = {2,		160308,		160328,		48,		_tmp_calender},
	[67] = {2,		160408,		160428,		48,		_tmp_calender},
	[68] = {1,		160508,		160528,		48,		_tmp_calender},
	[69] = {4,		160608,		160628,		48,		_tmp_calender},
	[70] = {5,		160708,		160728,		48,		_tmp_calender},
	[71] = {1,		160808,		160828,		48,		_tmp_calender},
	[72] = {4,		160908,		160928,		48,		_tmp_calender},
	[73] = {5,		161008,		161028,		48,		_tmp_calender},
	[74] = {3,		161108,		161128,		48,		_tmp_calender},
	[75] = {4,		161208,		161228,		48,		_tmp_calender},

	[76] = {5,		210108,		210128,		48,		_tmp_calender},
	[77] = {1,		210208,		210228,		48,		_tmp_calender},
	[78] = {2,		210308,		210328,		48,		_tmp_calender},
	[79] = {2,		210408,		210428,		48,		_tmp_calender},
	[80] = {1,		210508,		210528,		48,		_tmp_calender},
	[81] = {4,		210608,		210628,		48,		_tmp_calender},
	[82] = {5,		210708,		210728,		48,		_tmp_calender},
	[83] = {1,		210808,		210828,		48,		_tmp_calender},
	[84] = {4,		210908,		210928,		48,		_tmp_calender},
	[85] = {5,		211008,		211028,		48,		_tmp_calender},
	[86] = {3,		211108,		211128,		48,		_tmp_calender},
	[87] = {4,		211208,		211228,		48,		_tmp_calender},
}

--½áÎ²Á½¸ö¿ÕÈü¼¾±ÜÃâ¼«¶ËÇé¿ö
WLLS_SEASON_TB[getn(WLLS_SEASON_TB)+1] = {2,	999998,	999998,	0,	_tmp_calender}
WLLS_SEASON_TB[getn(WLLS_SEASON_TB)+1] = {2,	999999,	999999,	0,	_tmp_calender}

